<?php
ini_set("display_errors",1);
error_reporting(E_ALL);
require_once('function.php');


$array_str = array (
    "first" => "Программист знает тайны Вселенной всей,",
    "second" => "Он имеет огромную силу.",
    "third" => "Он путь нужный отыщет мышкой своей,",
    "fourth" => "И найдёт золотую жилу."
);
echo '<h1>Первый вариант Задания №1</h1>';
echo '<h2>Выводим массив строк в отдельном параграфе</h2>';
echo task1($array_str, false);


echo '<h2>Выводим массив строк в одну строку</h2>';
echo task1($array_str, true);

echo '<p></p>';
echo '<h1>Второй вариант Задания №1</h1>';
echo '<h2>Выводим массив строк в отдельном параграфе</h2>';
task11($array_str);
echo '<h2>Выводим массив строк в одну строку</h2>';
echo task11($array_str,true);
echo '<hr>';

////////////////////////////////

echo '<h1>Задание №2</h1>';
task2(array(15,0,2,5,7,8,9,0),'+');
echo '<hr>';

//////////////////////////////////////////

echo '<h1>Задание №3</h1>';
task3('+',4,5,6,7,14.6);
echo '<hr>';

//////////////////////////////////////////

echo '<h1>Задание №4</h1>';
task4(8,-2);
echo '<hr>';

//////////////////////////////////////////

echo '<h1>Задание №5</h1>';
task5_two('а роза упала на лапу Азора');
echo '<hr>';
//////////////////////////////////////////

echo '<h1>Задание №6</h1>';
echo date('d.m.Y H:i');
echo '<br>';
echo date('d.m.Y H:i', 1456261200);
echo '<hr>';
//////////////////////////////////////////

echo '<h1>Задание №7</h1>';
echo task7_one('Карл у Клары украл Кораллы');
echo '<br>';
echo task7_two('Две бутылки лимонада','Три'); // Дополнил тем, что можно любое слово взамен "Две" ставить
echo '<hr>';

//////////////////////////////////////////

echo '<h1>Задание №8</h1>';
echo task8('RX packets:950381 errors:0 dropped:0 overruns:0 frame:0.');
echo '<hr>';
//////////////////////////////////////////

echo '<h1>Задание №9</h1>';
echo task9('test');
echo '<hr>';
//////////////////////////////////////////

echo '<h1>Задание №10</h1>';
echo task10();
echo '<hr>';
